package week1.lesson2;
/*
 *  Task4.
	1) Написать метод, который в качестве параметра принимает имя файла.
	Метод возвращает двухмерный массив (String): имена переменных и значение.
	
	В файле набор переменных указаны так:
	;v=[156],ghg,hg;m=[12],tytuyr894848;vector=[qwe]; 
	Существуют правила форматирования текста в файле:
	 - имя переменной всегда стоит между симвоами ';' и '='
	 - значение переменной всегда идет после знака '=' и заключено в квадратные кавычки
	 - все что идет после квадратных кавычек до ';' являются служебными символами и в данной задаче они игнорируются
	
	2) В мейне:
	- создать массив, 
	- считать с консоли имя файла, 
	- передать его в метод 1
	- полученный массив передать в метод 2 (ВЫВОД НА ЭКРАН)
 */
public class Task4 {

}
